
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	Справочники.Хранилища.ЗагрузитьНовыеВерсии(ПараметрКоманды);
	#Иначе
	ВыгрузитьВерсииВРепозитории(ПараметрКоманды);
	#КонецЕсли
	
	ПоказатьОповещениеПользователя("Загрузить версии из хранилища",,"Загрузить версии из хранилища выполнена успешно");
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВерсииВРепозитории(Хранилище)
	
	Справочники.Хранилища.ЗагрузитьНовыеВерсии(Хранилище);
	
КонецПроцедуры

