
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбработкаКомандыНаСервере(ПараметрКоманды);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаКомандыНаСервере(ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Хранилища") Тогда 
		Справочники.Метрики.СобратьМетрикиПоХранилищу(ПараметрКоманды);
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ВерсииКонфигурацийХранилища") Тогда  	
		Справочники.Метрики.СобратьМетрикиПоВерсии(ПараметрКоманды);
		
	КонецЕсли;	
	
КонецПроцедуры	
