
Функция СоздатьВнешнююОбработкуОтчетПоСсылке(ОбработкаСсылка) Экспорт
	
	ДанныеОбработки = ОбщегоНазначениеСервер.ПолучитьЗначенияРеквизитов(ОбработкаСсылка,"ВидОбработки,ХранилищеВнешнейОбработки");
	
	ДопДанные = ДополнительныеДанныеПоВидуОбработки(ДанныеОбработки.ВидОбработки);
	Расширение = ДопДанные.Расширение;
	Менеджер = Вычислить(ДопДанные.ТипМенеджера);
	
	ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные = Base64Значение(ДанныеОбработки.Хранилище);
	ДвоичныеДанные.Записать(ИмяФайла);
	
	Результат = Менеджер.Создать(ИмяФайла, Ложь);
		
	Возврат Результат;
	
КонецФункции

Функция ДополнительныеДанныеПоВидуОбработки(ВидОбработки) Экспорт 
	
	Результат = Новый Структура;
	
	Если ВидОбработки = Перечисления.ВидыОбработок.ВнешнийОтчет Тогда 
		Результат.Вставить("Расширение", "ERF"); 
		Результат.Вставить("ТипМенеджера", "ВнешниеОтчеты");
		Результат.Вставить("Фильтр", "Внешний отчет(*.erf)|*.erf");

	Иначе 
		Результат.Вставить("Расширение","EPF");
		Результат.Вставить("ТипМенеджера", "ВнешниеОбработки");
		Результат.Вставить("Фильтр", "Внешняя обработка(*.epf)|*.epf");

	КонецЕсли;	
	
	Возврат Результат;;
	
КонецФункции	

