
Функция СобратьДанныеПоВерсиям(Версии) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Версии", Версии);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВерсииКонфигурацийХранилища.Владелец КАК Хранилище,
	|	ВерсииКонфигурацийХранилища.Ссылка КАК Версия,
	|	ВерсииКонфигурацийХранилища.Код КАК НомерВерсии,
	|	ВерсииКонфигурацийХранилища.НомерВХранилище КАК НомерВерсииВХранилище,
	|	ВерсииКонфигурацийХранилища.ДатаСоздания КАК ДатаСоздания,
	|	ВЫБОР
	|		КОГДА ВерсииКонфигурацийХранилища.Пользователь.ИмяПользователя = """"
	|			ТОГДА ВерсииКонфигурацийХранилища.Пользователь.Наименование
	|		ИНАЧЕ ВерсииКонфигурацийХранилища.Пользователь.ИмяПользователя
	|	КОНЕЦ КАК ИмяПользователя,
	|	ВерсииКонфигурацийХранилища.Пользователь.Email КАК EmailПользователя,
	|	ВерсииКонфигурацийХранилища.Комментарий КАК Комментарий,
	|	ВерсииКонфигурацийХранилища.ВерсияКонфигурации КАК ВерсияКонфигурации
	|ИЗ
	|	Справочник.ВерсииКонфигурацийХранилища КАК ВерсииКонфигурацийХранилища
	|ГДЕ
	|	ВерсииКонфигурацийХранилища.Ссылка В(&Версии)";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	Возврат ОбщегоНазначениеСервер.ТаблицаЗначенийВМассив(ТаблицаРезультат);
	
КонецФункции

Функция СобратьДанныеПоВерсии(Версия) Экспорт 
	
	Возврат СобратьДанныепоВерсиям(ГлЗначениеВМассиве(Версия))[0]; 
	
КонецФункции	


